#Квадратное уравнение. Пользователь вводит 3 коэффициента a, b и с. 
#Программа вычисляет дискриминант (D) и корни уравнения (x1 и x2, если они есть) и выводит значения дискриминанта и корней на экран. 
#При этом возможны следующие варианты:
#  Если D > 0, то выводим дискриминант и 2 корня
#  Если D = 0, то выводим дискриминант и 1 корень (т.к. корни в этом случае равны)
#  Если D < 0, то выводим дискриминант и сообщение "Корней нет"
#Подсказка: Алгоритм решения с блок-схемой (www.bolshoyvopros.ru). Для вычисления квадратного корня, нужно использовать  
# 
#Math.sqrt
# 
# Например,  
# 
#Math.sqrt(16)
# 
#  вернет 4, т.е. квадратный корень из 16.
#

print "Input a: "
a = Integer(gets.chomp)

print "Input b: "
b = Integer(gets.chomp)

print "Input c: "
c = Integer(gets.chomp)

d = b**2 - 4 * a * c

if d > 0
  x1 = (-b + Math.sqrt(d))/2*a
  x2 = (-b - Math.sqrt(d))/2*a
  puts "d = #{d}, x1 = #{x1}, x2 = #{x2}"
elsif d == 0
  x = (-b)/2*a
  puts "d = #{d}, x(1,2) = #{x}"
else
  puts "d = #{d}, there are no roots"
end